Revit 2026 API

# IExternalDBApplication Interface

---

An interface that supports addition of DB-level external applications to Revit, to subscribe to DB-level events and updaters.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IExternalDBApplication
```
```vb
Public Interface IExternalDBApplication
```
```cpp
public interface class IExternalDBApplication
```
```fsharp
type IExternalDBApplication = interface end
```

The IExternalDBApplication type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OnShutdown | Implement this method to execute some tasks when Autodesk Revit shuts down. |
|  | OnStartup | Implement this method to execute some tasks when Autodesk Revit starts. |

DB-level applications are permitted to add DB-level events and updaters to the session. They cannot create or modify UI.

#### Reference

Autodesk.Revit.DB Namespace